# pandas

In [1]:
import numpy as np
import pandas as pd

#### Zadanie 1

Lista `movies` zawiera najwyżej ocenione filmy w rankingu Filmweb, posortowane od najlepiej ocenionych. Każdy element to tuple, w którym znajduje się:

0. tytuł
1. rok
2. średnia ocena
3. reżyser
4. budżet (USD)
5. przychód (USD)

Podaj:

- ilość oraz tytuły filmów powstałych przed rokiem 2000 (ilość elementów `DataFrame` można uzyskać funkcją `len()`)
- filmy ze średnią oceną powyżej 8.5 i budżetem poniżej 10 mln USD
- 3 najlepsze filmy, których przychód był co najmniej 10-krotnie większy niż budżet

In [2]:
movies = [
    ("Skazani na Shawshank", 1994, 8.75, "Frank Darabont", 25_000_000, 59_841_469),
    ("Nietykalni", 2011, 8.63, "Olivier Nakache", 9_500_000, 426_588_510),
    ("Zielona mila", 1999, 8.61, "Frank Darabont", 60_000_000, 286_801_374),
    ("Ojciec chrzestny", 1972, 8.59, "Francis Ford Coppola", 6_000_000, 245_066_411),
    ("Dwunastu gniewnych ludzi", 1957, 8.54, "Sidney Lumet", 340_000, 2_000_000),
    ("Forrest Gump", 1994, 8.52, "Robert Zemeckis", 55_000_000, 677_387_716),
    ("Lot nad kukułczym gniazdem", 1975, 8.44, "Miloš Forman", 3_000_000, 108_981_275),
    ("Ojciec chrzestny II", 1974, 8.38, "Francis Ford Coppola", 13_000_000, 193_000_000),
    ("Joker", 2019, 8.36, "Todd Phillips", 55_000_000, 1_071_014_743),
    ("Lista Schindlera", 1993, 8.33, "Steven Spielberg", 22_000_000, 322_139_355)
]

In [3]:
movies_df = pd.DataFrame(movies, columns=['title', 'year', 'avg_rate', 'director', 'budget', 'income'])
movies_df

,title,year,avg_rate,director,budget,income
0,Skazani na Shawshank,1994,8.75,Frank Darabont,25000000,59841469
1,Nietykalni,2011,8.63,Olivier Nakache,9500000,426588510
2,Zielona mila,1999,8.61,Frank Darabont,60000000,286801374
3,Ojciec chrzestny,1972,8.59,Francis Ford Coppola,6000000,245066411
4,Dwunastu gniewnych ludzi,1957,8.54,Sidney Lumet,340000,2000000
5,Forrest Gump,1994,8.52,Robert Zemeckis,55000000,677387716
6,Lot nad kukułczym gniazdem,1975,8.44,Miloš Forman,3000000,108981275
7,Ojciec chrzestny II,1974,8.38,Francis Ford Coppola,13000000,193000000
8,Joker,2019,8.36,Todd Phillips,55000000,1071014743
9,Lista Schindlera,1993,8.33,Steven Spielberg,22000000,322139355

In [4]:
before_2000 = movies_df[ movies_df['year'] < 2000 ]
print(f'Ilość: {len(before_2000)}')
print(before_2000['title'])

Ilość: 8
0          Skazani na Shawshank
2                  Zielona mila
3              Ojciec chrzestny
4      Dwunastu gniewnych ludzi
5                  Forrest Gump
6    Lot nad kukułczym gniazdem
7           Ojciec chrzestny II
9              Lista Schindlera
Name: title, dtype: object

In [5]:
movies_df[ (movies_df['avg_rate'] > 8.5) & (movies_df['budget'] < 10_000_000) ]

,title,year,avg_rate,director,budget,income
1,Nietykalni,2011,8.63,Olivier Nakache,9500000,426588510
3,Ojciec chrzestny,1972,8.59,Francis Ford Coppola,6000000,245066411
4,Dwunastu gniewnych ludzi,1957,8.54,Sidney Lumet,340000,2000000

In [6]:
movies_df[ movies_df['income'] >= movies_df['budget'] * 10 ].iloc[0:3]

              title  year  avg_rate              director    budget     income
1        Nietykalni  2011      8.63       Olivier Nakache   9500000  426588510
3  Ojciec chrzestny  1972      8.59  Francis Ford Coppola   6000000  245066411
5      Forrest Gump  1994      8.52       Robert Zemeckis  55000000  677387716

#### Zadanie 2

Lista `t` zawiera kolejne listy opisujące boki a i b trójkątów prostokątnych.

```
  |\
  | \
a |  \ c
  |   \
  |____\
     b
```

- stwórz DataFrame zawierający dane z listy pod nazwanymi kolumnami `a` i `b`
- dodaj kolumnę `c` z obliczoną długością przeciwprostokątnej
- dodaj kolumnę `l` z obliczoną sumaryczną długością boków
- podaj sumaryczną długość boków wszystkich trójkątów

In [7]:
t = [
    [3, 4],
    [5, 12],
    [8, 15],
    [7, 24],
    [9, 40],
]
t

[[3, 4], [5, 12], [8, 15], [7, 24], [9, 40]]

In [8]:
t_df = pd.DataFrame(t, columns=['a', 'b'])
t_df

   a   b
0  3   4
1  5  12
2  8  15
3  7  24
4  9  40

In [9]:
t_df['c'] = np.sqrt((t_df['a'] ** 2) + (t_df['b'] ** 2))
t_df

   a   b     c
0  3   4   5.0
1  5  12  13.0
2  8  15  17.0
3  7  24  25.0
4  9  40  41.0

In [10]:
t_df['l'] = t_df['a'] + t_df['b'] + t_df['c']
t_df

   a   b     c     l
0  3   4   5.0  12.0
1  5  12  13.0  30.0
2  8  15  17.0  40.0
3  7  24  25.0  56.0
4  9  40  41.0  90.0

In [11]:
t_df['l'].sum()

228.0